using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace ChinaTower.Verification.Models.Infrastructures
{
    public static class Hash
    {
        public static Dictionary<FormType, int> UniqueKey = new Dictionary<FormType, int>
        {
            { FormType.衰减器, 0},
            { FormType.直流配电设备, 0 },
            { FormType.合路器,1},
            { FormType.负载,0 },
            { FormType.交流配电,0 },
            { FormType.高压配电,0  },
            { FormType.室内天线,0 },
            { FormType.低压配电,0  },
            { FormType.机房,1 },
            { FormType.机房空调设备,4 },
            { FormType.其他设备,3},
            { FormType.室外天线,1 },
            { FormType.外市电引入, 3 },
            { FormType.POI,0},
            { FormType.动力及环境单元,0 },
            { FormType.铁塔,1 },
            { FormType.铁塔平面,1},
            { FormType.整流器设备,0},
            { FormType.站址,1},
            { FormType.UPS,6 },
            { FormType.变压稳压,1 },
            { FormType.功分器,1 }
        };

        public static Dictionary<FormType, int?> Lon = new Dictionary<FormType, int?>
        {
            { FormType.衰减器, null },
            { FormType.直流配电设备, null },
            { FormType.合路器, null },
            { FormType.负载, null },
            { FormType.交流配电, null },
            { FormType.高压配电, 9 },
            { FormType.室内天线, null },
            { FormType.低压配电, null },
            { FormType.机房, 10 },
            { FormType.机房空调设备, null },
            { FormType.其他设备, null },
            { FormType.室外天线, null },
            { FormType.外市电引入, null },
            { FormType.POI, null },
            { FormType.动力及环境单元, null },
            { FormType.铁塔, 1 },
            { FormType.铁塔平面, null },
            { FormType.整流器设备, null },
            { FormType.站址, 8 },
            { FormType.UPS, null },
            { FormType.变压稳压, null },
            { FormType.功分器, null }
        };

        public static Dictionary<FormType, int?> Lat = new Dictionary<FormType, int?>
        {
            { FormType.衰减器, null },
            { FormType.直流配电设备, null },
            { FormType.合路器, null },
            { FormType.负载, null },
            { FormType.交流配电, null },
            { FormType.高压配电, 10 },
            { FormType.室内天线, null },
            { FormType.低压配电, null },
            { FormType.机房, 11 },
            { FormType.机房空调设备, null },
            { FormType.其他设备, null },
            { FormType.室外天线, null },
            { FormType.外市电引入, null },
            { FormType.POI, null },
            { FormType.动力及环境单元, null },
            { FormType.铁塔, 14 },
            { FormType.铁塔平面, null },
            { FormType.整流器设备, null },
            { FormType.站址, 9 },
            { FormType.UPS, null },
            { FormType.变压稳压, null },
            { FormType.功分器, null }
        };

        public static Dictionary<FormType, int?> StationId = new Dictionary<FormType, int?>
        {
            { FormType.衰减器, 3 },
            { FormType.直流配电设备, 3 },
            { FormType.合路器, 2 },
            { FormType.负载, 7 },
            { FormType.交流配电, 3 },
            { FormType.高压配电, 3 },
            { FormType.室内天线, 3 },
            { FormType.低压配电, 3 },
            { FormType.机房, 5 },
            { FormType.机房空调设备, 1 },
            { FormType.其他设备, 1 },
            { FormType.室外天线, 2 },
            { FormType.外市电引入, 1 },
            { FormType.POI, 3 },
            { FormType.动力及环境单元, 6 },
            { FormType.铁塔, 6 },
            { FormType.铁塔平面, 20 },
            { FormType.整流器设备, 4 },
            { FormType.站址, null },
            { FormType.UPS, 1 },
            { FormType.变压稳压, 4 },
            { FormType.功分器, 3 }
        };

        public static Dictionary<FormType, int?> City = new Dictionary<FormType, int?>
        {
            { FormType.衰减器, null },
            { FormType.直流配电设备, 5 },
            { FormType.合路器, null },
            { FormType.负载, null },
            { FormType.交流配电, 6 },
            { FormType.高压配电, 6 },
            { FormType.室内天线, null },
            { FormType.低压配电, 5 },
            { FormType.机房, 3 },
            { FormType.机房空调设备, 7 },
            { FormType.其他设备, 6 },
            { FormType.室外天线, 5 },
            { FormType.外市电引入, 6 },
            { FormType.POI, null },
            { FormType.动力及环境单元, 8 },
            { FormType.铁塔, 3 },
            { FormType.铁塔平面, null },
            { FormType.整流器设备, 7 },
            { FormType.站址, 3 },
            { FormType.UPS, 4 },
            { FormType.变压稳压, 7 },
            { FormType.功分器, null }
        };

        public static Dictionary<FormType, int?> District = new Dictionary<FormType, int?>
        {
            { FormType.衰减器, 29 },
            { FormType.直流配电设备, 6 },
            { FormType.合路器, 7 },
            { FormType.负载, 29 },
            { FormType.交流配电, 7 },
            { FormType.高压配电, 7 },
            { FormType.室内天线, 22 },
            { FormType.低压配电, 6 },
            { FormType.机房, 4 },
            { FormType.机房空调设备, 8 },
            { FormType.其他设备, 7 },
            { FormType.室外天线, 6 },
            { FormType.外市电引入, 7 },
            { FormType.POI, null },
            { FormType.动力及环境单元, 9 },
            { FormType.铁塔, 5 },
            { FormType.铁塔平面, 12 },
            { FormType.整流器设备, 8 },
            { FormType.站址, 4 },
            { FormType.UPS, 5 },
            { FormType.变压稳压, 8 },
            { FormType.功分器, 8 }
        };

        public static Dictionary<FormType, string[]> Headers = new Dictionary<FormType, string[]>
        {
            { FormType.衰减器, new string[] { "器材编号", "器材名称", "所属站点", "站点编码", "设备型号", "设备序列号", "所属室分", "设备类型", "别名", "上联设备类型", "器材名称", "上联馈线长度(M)", "上联馈线型号", "分配损耗（db）", "插入(耦合)损耗(db)", "隔离度(db)", "输入驻波比", "功率容量(W)", "频率范围", "带内平坦度(db)", "方向性(db)", "输入阻抗（Ω）", "耦合度(db)", "接头形式", "工作温度", "投产日期", "保修期", "软件版本", "备注", "所属区域", "创建人", "修改人", "创建时间", "修改时间" } },
            { FormType.直流配电设备, new string[] { "设备编码", "设备名称", "站址名称", "站址编码", "省", "市", "所属区域", "机房名称", "资源来源", "维护状态", "产权性质", "(原)产权单位", "生产厂商", "型号", "资源对象类型", "创建人", "创建时间", "修改人", "修改时间", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.合路器, new string[] { "器材名称","器材编号","站点编码","所属站点","设备序列号","设备型号","备注","所属区域","创建时间","修改时间","创建人","修改人","机房名称","所属楼层","上联设备类型","器材名称","上联馈线型号","上联馈线长度(M)","分配损耗（db）","插入(耦合)损耗(db)","隔离度(db)","输入驻波比","功率容量(W)","频率范围","带内平坦度(db)","方向性(db)","输入阻抗（Ω）","耦合度(db)","接头形式","工作温度","投产日期","保修期","软件版本","删除时间","删除状态","数据采集人","数据采集单位","数据采集时间","所属室分" } },
            { FormType.负载, new string[] { "器材编号", "器材名称", "所属站点", "设备型号", "设备序列号", "所属室分", "设备类型", "站点编码", "别名", "上联设备类型", "器材名称", "上联馈线长度(M)", "上联馈线型号", "分配损耗（db）", "插入(耦合)损耗(db)", "隔离度(db)", "输入驻波比", "功率容量(W)", "频率范围", "带内平坦度(db)", "方向性(db)", "输入阻抗（Ω）", "耦合度(db)", "接头形式", "工作温度", "投产日期", "保修期", "软件版本", "备注", "所属区域", "创建时间", "修改时间", "创建人", "修改人" } },
            { FormType.交流配电, new string[] { "设备编码", "设备名称", "站址名称", "站址编码", "机房名称", "省", "市", "所属区域", "资源对象类型", "使用状态", "总容量(A)", "生产厂商", "产权性质", "(原)产权单位", "设备最大载荷", "设备载荷预警值", "剩余端子预警值", "保修起始时间", "保修截止时间", "创建人", "创建时间", "修改人", "修改时间", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.高压配电, new string[] { "设备编号", "设备名称", "站址名称", "站址编码", "机房名称", "省", "市", "所属区域", "最大电压", "告警值", "功率", "资源来源", "经度", "纬度", "描述地址", "创建人", "修改人", "创建时间", "修改时间", "物理站址编码", "数据来源", "设备类型", "资产接收类型" } },
            { FormType.室内天线, new string[] { "器材编号", "器材名称", "所属站点", "站点编码", "所属室分", "别名", "分配损耗（db）", "插入(耦合)损耗(db)", "隔离度(db)", "输入驻波比", "功率容量(W)", "频率范围", "带内平坦度(db)", "方向性(db)", "输入阻抗（Ω）", "耦合度(db)", "接头形式", "工作温度", "投产日期", "保修期", "软件版本", "备注", "所属区域", "创建时间", "修改时间", "创建人", "修改人", "机房名称", "设备型号", "设备序列号", "上联设备类型", "器材名称", "上联馈线长度(M)", "上联馈线型号", "删除时间", "删除状态", "数据采集人", "数据采集单位", "数据采集时间" } },
            { FormType.低压配电, new string[] { "设备编号", "设备名称", "站址名称", "站址编码", "省", "市", "所属区域", "最大电压", "告警值", "功率", "使用状态", "设备类型", "资源来源", "创建时间", "修改时间", "创建人", "修改人", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.机房, new string[] { "机房名称", "机房编号", "省", "市", "区域名称", "站址编码", "站址名称", "机房类型", "机房面积", "地址", "经度", "纬度", "是否共享", "共享单位", "产权性质", "(原)产权单位", "是否有油机房", "故障状态", "封锁状态", "备注", "机房面积(平米)", "进深(米)", "机房净高(米)", "机房所在楼层", "开间(米)", "监理单位", "施工单位", "工程编号", "联系人", "联系电话", "投产日期", "资源来源", "入局光缆是否有空位", "馈线框总孔数", "馈线窗剩余孔位数", "馈线窗占用孔位数", "防雷箱品牌", "防雷箱型号", "灭火器型号", "灭火器数量", "维护状态", "进站路况", "进站难易程度", "进站困难原因", "车辆能否到达", "能否上站发电", "不能发电原因", "钥匙类型", "是否能扩建油机房", "机房治安环境", "是否有围墙", "允许发电时长（小时）", "录入人员", "录入时间", "修改人员", "物理站址编码", "数据来源", "资产接收类型" } },
            { FormType.机房空调设备, new string[] { "站址名称", "站址编码", "机房名称", "设备类型", "设备编码", "设备名称", "省", "市", "所属区域", "生产厂商", "型号", "使用状态", "业务状态", "产权性质", "(原)产权单位", "资源来源", "开始使用时间", "预计报废时间", "保修起始时间", "保修截止时间", "创建人", "创建时间", "修改人", "修改时间", "数据来源", "物理站址编码", "设备类型", "资产接收类型" } },
            { FormType.其他设备, new string[] { "站址名称", "站址编码", "机房名称", "设备编码", "设备名称", "省", "市", "所属区域", "设备类型", "业务状态", "维护状态", "产权性质", "(原)产权单位", "资源来源", "资源对象类型", "厂家名称", "设备型号", "创建人", "创建日期", "修改人", "修改日期", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.室外天线, new string[] { "天线名称", "天线编号", "站点编码", "站点名称", "省", "市", "所属区域", "启用时间", "天线下倾角", "天线方位角", "天线挂高", "详细地址", "系统编码", "序列号", "维护状态", "业务状态", "创建时间", "创建人", "抱杆名称", "修改人", "厂家名称", "备注", "是否带放大器", "频段", "维护协议", "保修协议", "第三方代维服务", "产权性质", "是否共享", "共用性", "扩展属性", "资源来源", "数据采集人", "数据采集单位", "数据采集时间" } },
            { FormType.外市电引入, new string[] { "站址名称", "站址编码", "机房名称", "市电编码", "市电名称", "省", "市", "区域名称", "生产厂家", "型号", "额定容量", "外电引入方式", "交流引入开关容量", "交流引入电缆线径型号", "高压线路铺设方式", "高压线路长度", "高压架空电缆是否裸线", "低压线路铺设方式", "低压线路长度", "变压器是否需要加固", "高压走廊是否需要砍青", "供电方", "交流供电方式", "电费单价", "支付方式", "是否峰谷支付", "转供单位", "转供联系电话", "供电合同号", "创建人", "创建时间", "修改人", "修改时间", "删除时间", "物理站址编码", "数据来源", "资产接收类型" } },
            { FormType.POI, new string[] { "器材编号", "器材名称", "所属站点", "站点编码", "设备型号", "设备序列号", "所属室分", "设备类型", "别名", "上联设备类型", "器材名称", "上联馈线长度(M)", "上联馈线型号", "分配损耗（db）", "插入(耦合)损耗(db)", "隔离度(db)", "输入驻波比", "功率容量(W)", "频率范围", "带内平坦度(db)", "方向性(db)", "输入阻抗（Ω）", "耦合度(db)", "接头形式", "工作温度", "投产日期", "保修期", "软件版本", "备注", "创建时间", "修改时间", "创建人", "修改人" } },
            { FormType.动力及环境单元, new string[] { "设备编号", "设备名称", "设备类型", "设备型号", "机房名称", "站址名称", "站址编码", "省", "市", "所属区域", "维护状态", "资源来源", "保修起始时间", "保修截止时间", "创建人", "创建时间", "修改人", "修改时间", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.铁塔, new string[] { "铁塔名称", "铁塔编号", "省", "市", "所属站址", "所属区域", "站址编码", "铁塔类型", "塔身高度(m)", "最低平台距地高度(m)" } },
            { FormType.铁塔平面, new string[] { "名称", "编码", "面积", "业务状态", "维护状态", "封锁状态", "故障状态", "海拔高度", "地面高度", "平台直径", "建设日期", "入网日期", "所属区域", "所属站址", "所属铁塔", "工程编号", "录入人员", "录入时间", "修改人员", "修改时间", "站址编码", "数据来源" } },
            { FormType.整流器设备, new string[] { "设备编号", "设备名称", "设备型号", "站址名称", "站址编码", "机房名称", "省", "市", "所属区域", "维护状态", "资源来源", "保修起始时间", "保修截止时间", "创建时间", "修改时间", "创建人", "修改人", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.站址, new string[] { "站址名称", "站址编码", "省", "市", "所属区域", "所属组织", "数据来源", "站址类型", "经度", "纬度", "所在地址", "站址等级", "维护状态", "封锁状态", "维护单位", "覆盖场景", "站址地形", "产权性质", "(原)产权单位", "是否共享", "共享单位", "物理站址编码", "历史物理站址编码", "站址内部编号", "站址拼音简称", "中文简称", "站址合并记录", "是否开通业务", "录入人员", "录入时间", "修改人", "修改时间", "站址接收标记", "是否有效" } },
            { FormType.UPS, new string[] { "站址名称", "站址编码", "机房名称", "省", "市", "所属区域", "设备编号", "设备名称", "业务状态", "维护状态", "资源来源", "设备类型", "设备型号", "生产厂商", "保修起始时间", "保修截止时间", "创建人", "创建时间", "修改人", "修改时间", "数据来源", "物理站址编码", "资产接收类型" } },
            { FormType.变压稳压, new string[] { "设备名称", "设备编号", "生产厂商", "站址名称", "站址编码", "机房名称", "省", "市", "所属区域", "启用时间", "维护状态", "创建时间", "修改时间", "创建人", "修改人", "数据来源", "物理站址编码", "设备子类型", "设备类型", "资产接收类型" } },
            { FormType.功分器, new string[] { "器材名称", "器材编号", "所属站点", "站点编码", "设备序列号", "设备型号", "别名", "备注", "所属区域", "创建时间", "创建人", "修改人", "修改时间" } }
        };
    }
}